<?php
//提出課題

for($i=0;$i<=100;$i++){
    echo $i;
    echo '<br>';
}

echo '<br>';

//IT用語
echo "1. サブクエリ".'<br>';
echo "副問い合わせとも呼ばれ、SQL文の中にSELECT文を埋め込み、抽出条件として利用すること。".'<br>';
echo "2. Bootstrap".'<br>';
echo "WEBサイトやWEBページを効率よく開発するためのWEBフレームワークです。HTML・CSS・JavaScriptから構成される、最も有名なWEBフレームワーク".'<br>';
echo "3. ライブラリ・フレームワーク".'<br>';
echo "ライブラリ・・・プログラム言語において、ある特定の機能を持つプログラムを定型化して、他のプログラムが引用できる状態にしたものを、複数集めてまとめたファイルのこと。".'<br>';
echo "フレームワーク・・・アプリケーションを開発するとき、その土台として機能させるソフトウェアのこと。「アプリケーションフレームワーク」とも呼ばれる。".'<br>';
?>
