<?php 
define("ADMIN_EMAIL","y-i-group@gmail.com");
define("LIST_COUNT",15);

echo ADMIN_EMAIL;
echo '<br>';
echo LIST_COUNT;
echo '<br>';
echo "1. デプロイ".'<br>';
echo "主にネットワークを通じて提供されるWebアプリケーションなどのシステム開発工程において、システムを利用可能な状態にすること".'<br>';
echo "2. バリデーション".'<br>';
echo "入力されたデータが、あるいはプログラミング言語やマークアップ言語の記述が、規定された文法に即して、または要求された仕様にそって、適切に記述されているかどうかを検証すること".'<br>';
echo "3．アジャイル・ウォーターフォール（開発手法）".'<br>';
echo "アジャイル・・・システムやソフトウェア開発におけるプロジェクト開発手法のひとつで、大きな単位でシステムを区切ることなく、小単位で実装とテストを繰り返して開発を進めていきます。従来の開発手法に比べて開発期間が短縮されるため、アジャイル（素早い）と呼ばれている。".'<br>';
echo "ウォーターフォール・・・システムの開発を「基本計画」「外部設計」「内部設計」「プログラム設計」「プログラミング」「テスト」という工程に分けて順に段階を経て行う方法です。 前の工程には戻らない前提であることから、下流から上流へは戻らない水の流れにたとえてウォータフォールと呼ばれている。".'<br>';
?> 